In [1]:
import pandas as pd

#Supermarket data

**‡∏î‡∏≤‡∏ß‡∏ô‡πå‡πÇ‡∏´‡∏•‡∏î‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏à‡∏≤‡∏Å**
https://drive.google.com/file/d/18XOHfl_9DX-BuBrtmGnzRO7djS5ylB_l/view?usp=sharing

‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏• supermarket data ‡πÄ‡∏õ‡πá‡∏ô‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ö‡∏±‡∏ô‡∏ó‡∏∂‡∏Å‡∏Å‡∏≤‡∏£‡∏ã‡∏∑‡πâ‡∏≠‡∏™‡∏¥‡∏ô‡∏Ñ‡πâ‡∏≤‡∏Ç‡∏≠‡∏á‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤‡∏à‡∏≤‡∏Å‡∏£‡πâ‡∏≤‡∏ô‡∏Ñ‡πâ‡∏≤‡∏à‡∏≤‡∏Å‡∏™‡∏≤‡∏Ç‡∏≤‡∏ï‡πà‡∏≤‡∏á‡πÜ ‡πÇ‡∏î‡∏¢‡∏°‡∏µ‡∏Å‡∏≤‡∏£‡πÄ‡∏Å‡πá‡∏ö‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡πÑ‡∏ß‡πâ 3 ‡πÑ‡∏ü‡∏•‡πå ‡πÑ‡∏î‡πâ‡πÅ‡∏Å‡πà


1. supermarket_distances:‡πÄ‡∏Å‡πá‡∏ö‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏£‡∏∞‡∏¢‡∏∞‡∏ó‡∏≤‡∏á‡∏à‡∏≤‡∏Å‡∏ö‡πâ‡∏≤‡∏ô‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤‡πÑ‡∏õ‡∏¢‡∏±‡∏á‡∏£‡πâ‡∏≤‡∏ô‡∏Ñ‡πâ‡∏≤‡∏™‡∏≤‡∏Ç‡∏≤‡∏ï‡πà‡∏≤‡∏á‡πÜ
2. supermarket_prices: ‡πÄ‡∏Å‡πá‡∏ö‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏£‡∏≤‡∏Ñ‡∏≤‡∏Ç‡∏≠‡∏á‡∏™‡∏¥‡∏ô‡∏Ñ‡πâ‡∏≤‡πÅ‡∏ï‡πà‡∏•‡∏∞‡∏ä‡∏¥‡πâ‡∏ô
3. supermarket_purchases: ‡πÄ‡∏Å‡πá‡∏ö‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏Å‡∏≤‡∏£‡∏ã‡∏∑‡πâ‡∏≠‡∏™‡∏¥‡∏ô‡∏Ñ‡πâ‡∏≤‡∏Ç‡∏≠‡∏á‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤

##Goal: ‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡∏ß‡∏¥‡πÄ‡∏Ñ‡∏£‡∏≤‡∏∞‡∏´‡πå‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ß‡πà‡∏≤‡∏£‡πâ‡∏≤‡∏ô‡∏Ñ‡πâ‡∏≤‡∏™‡∏≤‡∏Ç‡∏≤‡πÉ‡∏î‡∏ó‡∏≥‡∏¢‡∏≠‡∏î‡∏Ç‡∏≤‡∏¢‡∏Ç‡∏≠‡∏á‡πÅ‡∏ï‡πà‡∏•‡∏∞‡∏™‡∏≤‡∏Ç‡∏≤

In [2]:
#‡πÅ‡∏ï‡∏Å zip ‡πÑ‡∏ü‡∏•‡πå
!unzip /content/supermarket_data.zip

'unzip' is not recognized as an internal or external command,
operable program or batch file.

In [3]:
#code
df_distances = pd.read_csv("supermarket_data\supermarket_distances", delimiter=" ")
df_distances.head()

   customer_id  shop_id     distance
0            1        1  4082.522163
1            1        2   985.876199
2            1        3  2372.096966
3            1        4  4929.804616
4            1        5  3284.386737

In [4]:
#code
df_prices = pd.read_csv("supermarket_data\supermarket_prices", delimiter=" ")
df_prices.head()

   product_id  price
0           1  4.130
1           2  2.189
2           3  3.349
3           4  4.682
4           5  1.615

In [5]:
#code
df_purchases = pd.read_csv("supermarket_data\supermarket_purchases", delimiter=" ")
df_purchases.head()

   customer_id  product_id  shop_id  quantity
0            1         112        1         3
1            1         112        2        16
2            1         113        2         2
3            1         114        2         1
4            1         133        1         1

##Data collection
‡πÄ‡∏£‡∏≤‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏≠‡∏∞‡πÑ‡∏£‡∏ö‡πâ‡∏≤‡∏á ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡∏ï‡∏≠‡∏ö Goal ‡∏ó‡∏µ‡πà‡∏ï‡∏±‡πâ‡∏á‡πÑ‡∏ß‡πâ

In [6]:
#Ans
#product_id, shop_id, quantity, price

###DataMart


*   [pandas.DataFrame.merge](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html)
*   [pandas Merge, join, concatenate and compare](https://pandas.pydata.org/docs/user_guide/merging.html)

In [7]:
#code
df = df_purchases[['product_id', 'shop_id', 'quantity']]
df = df.merge(df_prices, how ='left', on="product_id")
df['total'] = df["quantity"]*df["price"]
df

          product_id  shop_id  quantity   price   total
0                112        1         3   0.334   1.002
1                112        2        16   0.334   5.344
2                113        2         2   0.269   0.538
3                114        2         1   0.344   0.344
4                133        1         1   1.048   1.048
...              ...      ...       ...     ...     ...
24638720        3894        1         3   2.637   7.911
24638721        3896        1         1   1.245   1.245
24638722        3897        1         1   1.959   1.959
24638723        1514        1         1  11.350  11.350
24638724        3296        1         1   3.355   3.355

[24638725 rows x 5 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24638725 entries, 0 to 24638724
Data columns (total 5 columns):
 #   Column      Dtype
---  ------      -----
 0   product_id  int64
 1   shop_id     int64
 2   quantity    int64
 3   price       float64
 4   total       float64
dtypes: float64(2), int64(3)
memory usage: 939.9 MB

###Auto Profiling


*   [pandas-profiling](https://pypi.org/project/pandas-profiling/)

In [9]:
from ydata_profiling import ProfileReport

In [10]:
profile = ProfileReport(df)

In [11]:
profile.to_widgets()

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

c:\Users\gotxz\anaconda3\Lib\site-packages\matplotlib\image.py:181: UserWarning: Data with more than 2**24 rows cannot be accurately displayed. Downsampling to less than 2**24 rows before displaying. To remove this warning, manually downsample your data.
  warnings.warn(msg.format(n='2**24 rows'))

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render widgets:   0%|          | 0/1 [00:00<?, ?it/s]

VBox(children=(Tab(children=(Tab(children=(GridBox(children=(VBox(children=(GridspecLayout(children=(HTML(valu‚Ä¶

#ü•äWorkshop: Melbourne Housing Snapshot

**‡∏î‡∏≤‡∏ß‡∏ô‡πå‡πÇ‡∏´‡∏•‡∏î‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏à‡∏≤‡∏Å**
https://drive.google.com/file/d/1zRxc0S0ZecZnTCVvrSjw8nycyNrQ59_B/view?usp=sharing

##About Dataset
13580 rows, 21 columns

###Content
 The dataset includes Address, Type of Real estate, Suburb, Method of Selling, Rooms, Price, Real Estate Agent, Date of Sale and distance from C.B.D.

###Notes on Specific Variables

**`Rooms`**: Number of rooms

**`Price`**: Price in dollars

**`Method`**:
* S - property sold;
* SP - property sold prior;
* PI - property passed in;
* PN - sold prior not disclosed;
* SN - sold not disclosed;
* NB - no bid;
* VB - vendor bid;
* W - withdrawn prior to auction;
* SA - sold after auction;
* SS - sold after auction price not disclosed.
* N/A - price or highest bid not available.

**`Type`**:
* br - bedroom(s);
* h - house,cottage,villa, semi,terrace;
* u - unit, duplex;
* t - townhouse;
* dev site - development site;
* o res - other residential.

**`SellerG`**: Real Estate Agent

**`Date`**: Date sold

**`Distance`**: Distance from CBD

**`Regionname`**: General Region (West, North West, North, North east ‚Ä¶etc)

**`Propertycount`**: Number of properties that exist in the suburb.

**`Bedroom2`** : Scraped # of Bedrooms (from different source)

**`Bathroom`**: Number of Bathrooms

**`Car`**: Number of carspots

**`Landsize`**: Land Size

**`BuildingArea`**: Building Size

**`CouncilArea`**: Governing council for the area

‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏Ç‡∏≠‡∏á‡∏£‡∏≤‡∏Ñ‡∏≤‡∏Ç‡∏≤‡∏¢‡∏ö‡πâ‡∏≤‡∏ô‡πÉ‡∏ô Melbourne ‡∏°‡∏µ‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏• 3 ‡πÑ‡∏ü‡∏•‡πå ‡πÑ‡∏î‡πâ‡πÅ‡∏Å‡πà
* Suburb_data.csv: ‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏Ç‡∏≠‡∏á‡πÄ‡∏Ç‡∏ï‡∏ä‡∏≤‡∏ô‡πÄ‡∏°‡∏∑‡∏≠‡∏á
* house_data.csv: ‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ö‡πâ‡∏≤‡∏ô
* sale_data.csv: ‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏Å‡∏≤‡∏£‡∏Ç‡∏≤‡∏¢

In [12]:
#read data
df_Suburb_data = pd.read_csv('MelbourneHousing_DS\Suburb_data.csv')
df_house_data = pd.read_csv('MelbourneHousing_DS\house_data.csv')
df_sale_data = pd.read_csv('MelbourneHousing_DS\sale_data.csv')

In [13]:
df_house_data.head()

,Suburb,Address,Lattitude,Longtitude,Distance,Type,Rooms,Bedroom2,Bathroom,Landsize
0,Abbotsford,85 Turner St,-37.7996,144.9984,2.5,h,2,2.0,1.0,202.0
1,Abbotsford,25 Bloomburg St,-37.8079,144.9934,2.5,h,2,2.0,1.0,156.0
2,Abbotsford,5 Charles St,-37.8093,144.9944,2.5,h,3,3.0,2.0,134.0
3,Abbotsford,40 Federation La,-37.7969,144.9969,2.5,h,3,3.0,2.0,94.0
4,Abbotsford,55a Park St,-37.8072,144.9941,2.5,h,4,3.0,1.0,120.0

In [14]:
df_sale_data.head()

,sale_no,Address,CouncilArea,YearBuilt,BuildingArea,Car,Price,Date,Method,SellerG
0,1,85 Turner St,Yarra,NaN,NaN,1.0,1480000.0,3/12/2016,S,Biggin
1,2,25 Bloomburg St,Yarra,1900.0,79.0,0.0,1035000.0,4/02/2016,S,Biggin
2,3,5 Charles St,Yarra,1900.0,150.0,0.0,1465000.0,4/03/2017,SP,Biggin
3,4,40 Federation La,Yarra,NaN,NaN,1.0,850000.0,4/03/2017,PI,Biggin
4,5,55a Park St,Yarra,2014.0,142.0,2.0,1600000.0,4/06/2016,VB,Nelson

In [15]:
df_Suburb_data.head()

         Suburb             Regionname  Postcode  Propertycount
0    Abbotsford  Northern Metropolitan    3067.0         4019.0
1  Airport West   Western Metropolitan    3042.0         3464.0
2   Albert Park  Southern Metropolitan    3206.0         3280.0
3    Alphington  Northern Metropolitan    3078.0         2211.0
4        Altona   Western Metropolitan    3018.0         5301.0

##üéØGoal1: ‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡∏û‡∏¢‡∏≤‡∏Å‡∏£‡∏ì‡πå‡∏£‡∏≤‡∏Ñ‡∏≤‡∏ö‡πâ‡∏≤‡∏ô‡∏à‡∏≤‡∏Å‡∏•‡∏±‡∏Å‡∏©‡∏∞‡∏Ç‡∏≠‡∏á‡∏ö‡πâ‡∏≤‡∏ô

###Data collection: ‡πÄ‡∏£‡∏≤‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏≠‡∏∞‡πÑ‡∏£‡∏ö‡πâ‡∏≤‡∏á ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡πÉ‡∏´‡πâ‡∏ó‡∏≥ Goal1 ‡πÑ‡∏î‡πâ

‡∏™‡∏£‡πâ‡∏≤‡∏á datamart ‡∏™‡∏≥‡∏´‡∏£‡∏±‡∏ö Goal1

In [16]:

#CODE
#Type, Rooms, Bedroom2, Bathroom, Landsize
df_goal1 = df_house_data[['Address','Type', 'Rooms', 'Bedroom2', 'Bathroom', 'Landsize']].merge(df_sale_data[['Address', 'Price']], how='left', on='Address')
display(df_goal1.sample(10))
df_goal1.isnull().sum()

                 Address Type  Rooms  Bedroom2  Bathroom  Landsize      Price
920           1 Jassa St    h      3       3.0       1.0     686.0  1352000.0
13316       25 Ramleh Rd    h      4       4.0       2.0     743.0   920000.0
5402   110/61 Stawell St    u      1       1.0       1.0    7455.0   405000.0
12771      38 Allison Av    h      3       3.0       2.0     705.0  2200000.0
1071     1/112 Roslyn St    u      2       2.0       2.0     329.0  1300000.0
4978       62 Pridham St    h      3       3.0       2.0     146.0  1612000.0
10225      5 Eastgate St    h      5       5.0       2.0     546.0  1750000.0
7806     9/211 Weston St    u      2       2.0       1.0       0.0   835000.0
4117     4/30 Kenmare St    h      5       5.0       4.0     355.0  1400000.0
6830         136 Hyde St    h      4       4.0       2.0     482.0  1150000.0

Address     0
Type        0
Rooms       0
Bedroom2    0
Bathroom    0
Landsize    0
Price       0
dtype: int64

##üéØGoal2: ‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡∏û‡∏¢‡∏≤‡∏Å‡∏£‡∏ì‡πå‡∏£‡∏≤‡∏Ñ‡∏≤‡∏ö‡πâ‡∏≤‡∏ô‡∏à‡∏≤‡∏Å‡∏ó‡∏≥‡πÄ‡∏•‡∏ó‡∏µ‡πà‡∏ï‡∏±‡πâ‡∏á‡∏Ç‡∏≠‡∏á‡∏ö‡πâ‡∏≤‡∏ô

###Data collection: ‡πÄ‡∏£‡∏≤‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏≠‡∏∞‡πÑ‡∏£‡∏ö‡πâ‡∏≤‡∏á ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡πÉ‡∏´‡πâ‡∏ó‡∏≥ Goal2 ‡πÑ‡∏î‡πâ

‡∏™‡∏£‡πâ‡∏≤‡∏á datamart ‡∏™‡∏≥‡∏´‡∏£‡∏±‡∏ö Goal2

In [17]:
#CODE
#Address, Lattitude, Longtitude, Distance
df_goal2 = df_house_data[['Address', 'Suburb', 'Lattitude', 'Longtitude', 'Distance']].merge(df_sale_data[['Address', 'Price']], how='left', on='Address')
display(df_goal2.sample(10))
df_goal2.isnull().sum()

,Address,Suburb,Lattitude,Longtitude,Distance,Price
1127,2/61 Black St,Brighton,-37.91640,145.00020,11.2,800000.0
12540,28 Highfield Rd,Doncaster East,-37.78758,145.16792,14.3,1381000.0
13043,21 Chicquita Cct,Mentone,-37.97928,145.07630,20.0,792000.0
3681,75 Derby St,Kew,-37.80070,145.03740,5.6,1910000.0
10173,1/30 Burns St,Maidstone,-37.78707,144.87608,6.4,810000.0
120,17 Reed St,Albert Park,-37.84480,144.94530,3.3,1740000.0
5156,15 Rodman St,Reservoir,-37.70200,145.00710,11.2,810000.0
7209,10 Cleve Gr,Heidelberg,-37.75070,145.06200,10.6,1195000.0
3134,16 Smith St,Hampton,-37.93320,145.02260,13.7,772000.0
8466,86 Malpas St,Preston,-37.73360,145.01680,8.8,1010000.0

Address       0
Suburb        0
Lattitude     0
Longtitude    0
Distance      0
Price         0
dtype: int64

##üéØQA: datamart ‡∏ó‡∏±‡πâ‡∏á‡∏™‡∏≠‡∏á‡∏Å‡πâ‡∏≠‡∏ô‡∏û‡∏£‡πâ‡∏≠‡∏°‡πÉ‡∏ä‡πâ‡∏´‡∏£‡∏∑‡∏≠‡∏¢‡∏±‡∏á? ‡∏ñ‡πâ‡∏≤‡∏¢‡∏±‡∏á‡πÑ‡∏°‡πà‡∏û‡∏£‡πâ‡∏≠‡∏° ‡∏ó‡∏≥‡πÑ‡∏°‡∏ñ‡∏∂‡∏á‡∏¢‡∏±‡∏á‡πÑ‡∏°‡πà‡∏û‡∏£‡πâ‡∏≠‡∏°?

In [18]:
#ANS:
#‡∏û‡∏£‡πâ‡∏≠‡∏°‡πÅ‡∏•‡πâ‡∏ß ‡πÄ‡∏ô‡∏∑‡πà‡∏≠‡∏á‡∏à‡∏≤‡∏Å‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ñ‡∏π‡∏Å‡∏Ñ‡∏±‡∏î‡∏Å‡∏£‡∏≠‡∏á‡πÉ‡∏´‡πâ‡∏™‡∏≠‡∏î‡∏Ñ‡∏•‡πâ‡∏≠‡∏á‡∏Å‡∏±‡∏ö‡∏Ñ‡∏ß‡∏≤‡∏°‡∏ï‡πâ‡∏≠‡∏á‡∏Å‡∏≤‡∏£‡πÄ‡∏£‡∏µ‡∏¢‡∏ö‡∏£‡πâ‡∏≠‡∏¢